#### Production Terraform Plan 🚀
<details><summary>Plan: 4 to add, 0 to change, 1 to destroy. (Click to expand details)</summary>

```terraform
module.infrastructure.module.ingestion.aws_ecr_repository.ingestion_lambda: Refreshing state... [id=currency-converter-api-ingestion-lambda-production]
module.infrastructure.module.ingestion.aws_s3_bucket.data_storage_bucket: Refreshing state... [id=currency-converter-api-data-storage-bucket-production]
module.infrastructure.module.ingestion.aws_ecr_lifecycle_policy.ingestion_lambda: Refreshing state... [id=currency-converter-api-ingestion-lambda-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.module.ingestion.aws_ecr_lifecycle_policy.ingestion_lambda must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "ingestion_lambda" {
      ~ id          = "currency-converter-api-ingestion-lambda-production" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ description  = "Delete untagged images to save costs" -> "Rule 1: IMMUNITY for the latest tag (Never delete)"
                      ~ selection    = {
                          + tagPrefixList = [
                              + "latest",
                            ]
                          ~ tagStatus     = "untagged" -> "tagged"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Rule 2: CAP at 5 images (Delete 6th oldest immediately)"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Rule 3: EXPIRY at 7 days (Cleanup old versions)"
                      + rulePriority = 3
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "any"
                        }
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "756316131141" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.infrastructure.module.ingestion.aws_iam_role.ingestion_lambda will be created
  + resource "aws_iam_role" "ingestion_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "currency-converter-api-ingestion-lambda-role-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "currency-converter-api"
          + "Environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.ingestion.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "currency-converter-api-ingestion-lambda-role-production"
    }

  # module.infrastructure.module.ingestion.aws_lambda_function.ingestion_lambda will be created
  + resource "aws_lambda_function" "ingestion_lambda" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "currency-converter-api-ingestion-lambda-production"
      + id                             = (known after apply)
      + image_uri                      = "756316131141.dkr.ecr.eu-west-1.amazonaws.com/currency-converter-api-ingestion-lambda-production:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "currency-converter-api"
          + "Environment" = "production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>

*Pushed by: @Ryhhill1998, Action: `pull_request`*